{"keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "name": "conv2d_11", "kernel_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "batch_input_shape": [null, 128, 128, 3], "padding": "valid", "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_7", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_12", "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "padding": "valid", "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_8", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_13", "kernel_regularizer": null, "kernel_constraint": null, "filters": 64, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "padding": "valid", "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_4"}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 12, "activity_regularizer": null, "bias_constraint": null, "name": "dense_5", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "softmax", "trainable": true, "bias_regularizer": null}}], "backend": "tensorflow"}